In [1]:
%load_ext sql
import sqlite3
import pandas as pd

In [2]:
%sql sqlite:///CourseDataWarehouse.db
conn = sqlite3.connect('CourseDataWarehouse.db')

In [14]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

In [3]:
%%sql
DROP TABLE IF EXISTS INSTRUCTORS;

CREATE TABLE INSTRUCTORS(
    INSTRUCTOR_ID INTEGER PRIMARY KEY,
    INSTRUCTOR_NAME TEXT NOT NULL);

 * sqlite:///CourseDataWarehouse.db
Done.
Done.

[]

In [4]:
%%sql
DROP TABLE IF EXISTS PROGRAMS;
CREATE TABLE PROGRAMS(
    PROGRAM_ID INTEGER PRIMARY KEY,
    PROGRAM_CODE TEXT NOT NULL,
    PROGRAM_NAME TEXT NOT NULL);

 * sqlite:///CourseDataWarehouse.db
Done.
Done.

[]

In [5]:
%%sql
DROP TABLE IF EXISTS LOCATIONS;
CREATE TABLE LOCATIONS(
    LOCATION_ID INTEGER PRIMARY KEY,
    ROOM_ID TEXT);

 * sqlite:///CourseDataWarehouse.db
Done.
Done.

[]

In [36]:
%%sql
DROP TABLE IF EXISTS TIME_SLICES;
CREATE TABLE TIME_SLICES(
    TIMECODE INTEGER PRIMARY KEY,
    DAY TEXT,
    START TEXT,
    END TEXT);

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.
Done.

[]

In [9]:
%%sql
DROP TABLE IF EXISTS CALENDAR_DATES;
CREATE TABLE CALENDAR_DATES(
    TERM TEXT PRIMARY KEY,
    YEAR TEXT);

 * sqlite:///CourseDataWarehouse.db
Done.
Done.

[]

In [11]:
%%sql
DROP TABLE IF EXISTS COURSE_FACTS;
CREATE TABLE COURSE_FACTS(
    CATALOG_ID TEXT NOT NULL,
    TITLE TEXT NOT NULL,
    PREREQ TEXT,
    COREQ TEXT,
    SECTION TEXT,
    CAPACITY INTEGER,
    ACTUAL INTEGER,
    REMAINING INTEGER,
    CREDITS INTEGER,
    TIME_CODE TEXT NOT NULL,
    TERM TEXT NOT NULL,
    LOCATION_ID INTEGER NOT NULL,
    INSTRUCTOR_ID INTEGER NOT NULL,
    PROGRAM_ID INTEGER NOT NULL,
    FOREIGN KEY (TIME_CODE)
        REFERENCES TIME_SLICES (TIME_CODE)
        ON UPDATE CASCADE,
    FOREIGN KEY (TERM)
        REFERENCES CALENDAR_DATES (TERM)
        ON UPDATE CASCADE,
    FOREIGN KEY (LOCATION_ID)
        REFERENCES LOCATIONS (LOCATION_ID)
        ON UPDATE CASCADE
    FOREIGN KEY (INSTRUCTOR_ID)
        REFERENCES INSTRUCTORS (INSTRUCTOR_ID)
        ON UPDATE CASCADE,
    FOREIGN KEY (PROGRAM_ID)
        REFERENCES PROGRAMS (PROGRAM_ID)
        ON UPDATE CASCADE
);

 * sqlite:///CourseDataWarehouse.db
Done.
Done.

[]

In [15]:
%%sql
SELECT COUNT(*)
FROM (SELECT * FROM PROGRAMS)

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[(83,)]

In [47]:
%%sql

INSERT INTO PROGRAMS (PROGRAM_CODE, PROGRAM_NAME)
SELECT PROGRAM_CODE, PROGRAM_NAME
FROM PROGRAMS

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
83 rows affected.

[]

In [44]:
%%sql
SELECT * 
FROM PROGRAMS
LIMIT 10;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[]

In [22]:
%%sql
SELECT COUNT(*)
FROM (SELECT * FROM INSTRUCTORS)

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[(1095,)]

In [23]:
%%sql
INSERT INTO INSTRUCTORS (INSTRUCTOR_NAME)
SELECT INSTRUCTOR_NAME
FROM INSTRUCTORS

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
1095 rows affected.

[]

In [24]:
%%sql
SELECT *
FROM INSTRUCTORS 
LIMIT 10;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos'),
 (6, 'Scott M  Brenner'),
 (7, 'Kevin C.  Cassidy'),
 (8, 'Bruce   Bradford'),
 (9, 'Milo W.  Peck'),
 (10, 'Stephen E.  Yost')]

In [25]:
%%sql
SELECT COUNT(*)
FROM (SELECT * FROM LOCATIONS)

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[(207,)]

In [26]:
%%sql 
INSERT INTO LOCATIONS (ROOM_ID)
SELECT ROOM_ID
FROM LOCATIONS

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
207 rows affected.

[]

In [27]:
%%sql
SELECT *
FROM LOCATIONS
LIMIT 10;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[(1, 'BCC 200'),
 (2, 'BD '),
 (3, 'BH '),
 (4, 'BH BY ARR'),
 (5, 'BLM 112'),
 (6, 'BLM LL105'),
 (7, 'BNW 124'),
 (8, 'BNW 127'),
 (9, 'BNW 128'),
 (10, 'BNW 129B')]

In [40]:
%%sql
SELECT DISTINCT DAY,substr(start,12,8) as StartTime, substr(end,12,8) as EndTime 
FROM COURSE_OFFERINGS
    JOIN COURSE_MEETINGS USING (COURSE_OFFERING_ID)
LIMIT 10;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[('T', '08:00:00', '09:15:00'),
 ('F', '08:00:00', '09:15:00'),
 ('T', '09:30:00', '10:45:00'),
 ('F', '09:30:00', '10:45:00'),
 ('T', '12:30:00', '13:45:00'),
 ('F', '12:30:00', '13:45:00'),
 ('R', '11:00:00', '12:15:00'),
 ('M', '11:00:00', '12:15:00'),
 ('R', '12:30:00', '13:45:00'),
 ('M', '12:30:00', '13:45:00')]

In [41]:
%%sql

DELETE FROM TIME_SLICES;

INSERT INTO TIME_SLICES ( DAY, START, END)
SELECT DISTINCT DAY,substr(start,12,8) as StartTime, substr(end,12,8) as EndTime 
FROM COURSE_OFFERINGS
    JOIN COURSE_MEETINGS USING (COURSE_OFFERING_ID)

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
284907 rows affected.
1090 rows affected.

[]

In [42]:
%%sql
SELECT *
FROM TIME_SLICES
LIMIT 10;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[(1, 'T', '08:00:00', '09:15:00'),
 (2, 'F', '08:00:00', '09:15:00'),
 (3, 'T', '09:30:00', '10:45:00'),
 (4, 'F', '09:30:00', '10:45:00'),
 (5, 'T', '12:30:00', '13:45:00'),
 (6, 'F', '12:30:00', '13:45:00'),
 (7, 'R', '11:00:00', '12:15:00'),
 (8, 'M', '11:00:00', '12:15:00'),
 (9, 'R', '12:30:00', '13:45:00'),
 (10, 'M', '12:30:00', '13:45:00')]